Repository: msdx/gradle-translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: For example, you might want the artifact deployed to the Maven repository to have a different version or name than the artifact generated by Gradle.
zh_cn: 例如，你可能希望部署到 Maven 仓库中的artifact 有不同的版本，或者是不同于 Gradle 生成的artifact 的名称。

source: For example:
zh_cn: 举个例子：

source: For further details on extra properties and their API, see ExtraPropertiesExtension.
zh_cn: 有关额外属性和它们的 API 的详细信息，请参阅ExtraPropertiesExtension。

source: For global Sonar properties, use the withGlobalProperties hook on SonarRootModel:
zh_cn: 对于全局的 Sonar 属性，可以使用SonarRootModel上的 withGlobalProperties hook：

source: For grouping JUnit test classes and methods JUnit 4.8 introduces the concept of categories.
zh_cn: 为对Junit 测试类和方法进行分组，JUnit 4.8引入了类别的概念。

source: For how to publish to a Maven repository, see the section Section 52.6, “Interacting with Maven repositories”.
zh_cn: 有关如何发布到 Maven 仓库，请参阅第 52.6节，”与Maven 仓库的交互“。

source: For how to run partial builds from the root see Section 56.4, “Running tasks by their absolute path”.
zh_cn: 有关如何从根目录运行部分的构建，见第 56.4章，“使用其绝对路径运行任务”。

source: For include this is "**/*Tests.class", "**/*Test.class" and the for exclude it is "**/Abstract*.class".
zh_cn: 对于 include 的默认值是 "**/*Tests.class"， "**/*Test.class"，而对于exclude它的默认值是 "**/Abstract*.class"。

source: For instance, this tight coupling of projects effectively prevents Gradle from building multiple projects in parallel, or from substituting a pre-built artifact in place of a project dependency.
zh_cn: 例如，紧耦合的项目实际上会阻碍 Gradle 在多项目上的并行构建，或是使用预构建的构件来代替某个项目依赖。

source: For local developer builds this is our favorite property.
zh_cn: 对于本地开发者的构建而言，这是我们最喜欢的属性。

source: For many projects there is not one right set of dependencies (as more or less imposed by the POM format).
zh_cn: 对于许多项目而言，可能不是只有正确的一组依赖（因POM格式的影响会多或少）。

source: For migration purposes this is a common technique with Gradle.
zh_cn: 出于迁移的目的，这是在 Gradle 中的一种常用技术。

source: For more advanced uses, you can define a task dependency using a closure.
zh_cn: 对于更高级的用法，您可以使用闭包来定义任务依赖。

source: For more details and examples please see the TestFilter reference.
zh_cn: 有关更多的详细信息和示例，请参阅TestFilter的文档。

source: For more details, see the API documentation of the convention object.
zh_cn: 有关更多详细信息，请参见约定对象的 API 文档。

source: For more details, take a look at the API documentation forResolutionStrategy.
zh_cn: 更多详细信息请参阅ResolutionStrategy的 API 文档。

source: For more exotic use cases you can even pass properties directly to the project object via system and environment properties.
zh_cn: 在更多的用法中，您甚至可以通过系统和环境属性把属性直接传给项目对象。

source: For more information about task dependencies, see the Task API.
zh_cn: 有关任务依赖的详细信息，请参阅Task的 API。

source: For more information about the API please refer to the javadocs on ResolvableDependencies.getResolutionResult().
zh_cn: 关于这个 API 的更多信息，请参考 ResolvableDependencies.getResolutionResult()上的文档。

source: For more information and code samples see ResolutionStrategy.
zh_cn: 更多的信息和代码示例请参阅ResolutionStrategy。

source: For more information on how to do this, see Section 59.5, “External dependencies for the build script”.
zh_cn: 有关如何进行此操作的详细信息，请参阅 59.5章节，“构建脚本的外部依赖”。

source: For more information on the inner workings of plugins, see Chapter 58, Writing Custom Plugins.
zh_cn: 关于插件的内部运作的详细信息，请参阅第 58 章，编写自定义插件。

source: For more information see the API documentation for ProjectDependency
zh_cn: 详细信息请参阅ProjectDependency的 API 文档

source: For more information, see the Ivy reference for ivy.xml.
zh_cn: 有关更多的信息，请参阅ivy.xml引用的Ivy。

source: For more on writing your own plugins, see Chapter 58, Writing Custom Plugins.
zh_cn: 关于编写自己的插件的详细信息，请参阅 58章节，编写自定义插件。

source: For most projects, this is the better choice than the Ant-based compiler.
zh_cn: 对于大多数项目而言，这相比基于 Ant 编译器，是个更好的选择。

source: For multi-project builds you can place gradle.properties files in any subproject directory.
zh_cn: 对于多项目构建，您可以将gradle.properties文件放在任何子项目的目录中。

source: For multiproject builds the situation is different.
zh_cn: 对于 multiproject 构建，这咱情况则不同。

source: For other ScalaCompile tasks, scalaCompileOptions.incrementalOptions.publishedCode needs to be configured to point to the classes folder or Jar archive by which the code is passed on to compile class paths of downstream ScalaCompile tasks.
zh_cn: 对于其他的 ScalaCompile 任务，需要根据类文件夹或 Jar archive 的代码中，是哪一个的代码被传递给ScalaCompile任务的下游类路径，把ScalaCompileOptions.incrementalOptions.publishedCode配置为指向它们。

source: For our sample, we will use Groovy 2.2.0 from the public Maven repository:
zh_cn: 下面例子中，我们会使用Maven中央仓库中的Groovy 2.2.0版本。

source: For per-project Sonar properties, use the withProjectProperties hook on SonarProject:
zh_cn: 对于每个项目的 Sonar 属性，使用SonarProject上的withProjectProperties hook：

source: For projects that also apply the Java Plugin, The JaCoCo plugin automatically adds the following tasks:
zh_cn: 对于同时也配置使用了 Java 插件的项目，JaCoCo 插件会自动添加以下任务：

source: For scenarios where the outputs of a task are not files, or for more complex scenarios, the TaskOutputs.upToDateWhen() method allows you to calculate programmatically if the tasks outputs should be considered up to date.
zh_cn: 对于任务的输出并不是文件的场景，或者是更复杂的场景， TaskOutputs.upToDateWhen()方法允许您以编程方式计算任务的输出是否应该被判断为最新状态。

source: For some properties (notably server and database connection settings), determining a suitable default is left to the Sonar Runner.
zh_cn: 对于一些属性（尤其是服务器和数据库的连接配置），确定留给 Sonar Runner 一个合适的默认值。

source: For some workflows, the user invokes Gradle many times to execute a small number of relatively quick tasks.
zh_cn: 对于一些工作流，用户会多次调用 Gradle，以执行少量的相对快速的任务。

source: For that use case please refer to Section 50.2.3, “Resolve version conflicts” and the documentation on ResolutionStrategy for a potentially better solution to the problem.
zh_cn: 使用这个案例，请参考第 50.2.3 节，“解决版本冲突”和关于ResolutionStrategy文档，以了解这个问题潜在的更好的解决方案。

source: For the examples below we have the following dependencies setup:
zh_cn: 下面的示例我们使用以下依赖设置：

source: For the jars and the correct POMs you still use the remote repository.
zh_cn: 对于这些jar 和不正确的 POMs，你依然要使用远程仓库。

source: For the latter you can declare Project Dependencies.
zh_cn: 对于后者，你可以声明项目依赖。

source: For the person service we declare that the project should be compiled only against the api interfaces but tested with all classes from api.
zh_cn: 对于 person service，我们定义了这个项目应该仅针对api 接口编译，但是对api里的所有类进行测试。

source: For this and other (mainly isolation) reasons, it is desirable to execute the Sonar Runner in a separate process.
zh_cn: 由于这个和其他（主要是隔离）的原因，最好在一个独立的进程中执行Sonar Runner。

source: For this layer Gradle provides integration simply by relying on Groovy, and the fantastic AntBuilder.
zh_cn: 这一层 Gradle 单靠 Groovy 和不可思议的 AntBuilder，对其提供了集成。

source: For this type of task, the action closure determines the behaviour of the task.
zh_cn: 对于这种类型的任务，action闭包决定了这个任务的行为。

source: Force versions can also be used to deal with rogue metadata of transitive dependencies.
zh_cn: 强制版本也可以用于处理传递依赖所带来的流氓元数据。

source: Forcing a module version tells Gradle to always use a specific version for given dependency (transitive or not), overriding any version specified in a published module descriptor.
zh_cn: 强制一个模块的版本，是告诉 Gradle 对于指定的依赖（不管是否传递依赖），始终使用一个特定的版本，而覆盖在发布的模块描述符中所指定的任何版本。

source: From a complex enterprise application written in Java depending on hundreds of open source libraries to the simplest Clojure application depending on a handful of libraries, approaches to dependency management vary widely and can depend on the target technology, the method of application deployment, and the nature of the project.
zh_cn: 从一个由 Java 编写的依赖了数以百计开源库的复杂企业应用，再到依赖少量库的最简单的 Clojure 应用，依赖管理的办法大不相同，并且可以依赖于目标的技术、应用程序部署的方法和项目的性质。

source: Fully qualified class name or fully qualified method name is supported, e.g. "org.gradle.SomeTest", "org.gradle.SomeTest.someMethod"
zh_cn: 支持完整的限定类名称或完整的限定的方法名称，例如“org.gradle.SomeTest”、“org.gradle.SomeTest.someMethod”

source: Further Information
zh_cn: 补充信息

source: Further task dependencies can be added as needed.
zh_cn: 根据需要，可以添加更多的任务依赖。

source: Furthermore, all properties that have been configured up to this point, including all properties preconfigured by Gradle, are available via the properties accessor.
zh_cn: 此外，所有已配置到这一点的属性，包括通过 Gradle 预配置的所有属性，还可通过properties访问器进行使用。

source: Furthermore, it is possible to specify settings that apply to all binaries produces for a particular executable or library component:
zh_cn: 此外，还可以指定设置应用于某个特定的executable 或 library 组件 产生的所有二进制文件：

source: Future versions of Gradle will automatically include the appropriate debug flags for any 'debug' build type, and may be aware of various levels of optimisation as well.
zh_cn: 未来版本的 Gradle 将自动包括任何“debug”构建类型的适当调试标志，并且还可能知道各个优化级别。

source: Generally, one can exclude transitive dependencies that are either not required by runtime or that are guaranteed to be available on the target environment/platform.
zh_cn: 一般来说，可以被排除的传递依赖，在运行时并不需要，或者是保证在目标环境或平台上可用。

source: Generally, this JAR might include some custom plugins, or bundle several related task classes into a single library.
zh_cn: 一般来说，这个JAR可能包含一些自定义的插件，或者是捆绑几个相关的任务类到一个单独的库当中。

source: Generated POMs can be found in <buildDir>/poms.
zh_cn: 生成的 POMs 可以在<buildDir>/poms看到。

source: Generates .classpath and JDT settings file.
zh_cn: 生成.classpath和 JDT 设置文件。

source: Generates API documentation for the production Groovy source files.
zh_cn: 为production 里的 Groovy 源文件生成 API 文档。

source: Generates API documentation for the production Java source, using Javadoc
zh_cn: 使用 Javadoc 生成生产的 Java 源代码的API文档

source: Generates API documentation for the production Scala source files.
zh_cn: 为production 里的 Scala 源文件生成 API 文档。

source: Generates Gradle wrapper files.
zh_cn: 生成 Gradle wrapper 文件。

source: Generates WTP settings files only if eclipse-wtp plugin was applied.
zh_cn: 仅当eclipse-wtp插件被应用时生成 WTP 设置文件。

source: Generates a Gradle project.
zh_cn: 生成一个 Gradle 项目。

source: Generates all Eclipse configuration files
zh_cn: 会生成所有的 Eclipse 配置文件

source: Generates all IDEA configuration files
zh_cn: 生成所有的 IDEA 配置文件

source: Generates all project reports.
zh_cn: 生成所有项目报告。

source: Generates an HTML dependency and dependency insight report for the project or a set of projects.
zh_cn: 对项目或项目集生成 HTML 依赖和依赖透视报告。

source: Generates an IDEA module file.
zh_cn: 生成一个IDEA 模块文件。

source: Generates build dashboard report.
zh_cn: 生成 build dashboard 报告。

source: Generates code coverage report for the test task.
zh_cn: 为测试任务生成代码覆盖率报告。

source: Generates dependencies (both external and inter-module)
zh_cn: 生成依赖 (包括外部的和模块间的)

source: Generates download repositories (inc.
zh_cn: 生成下载仓库（包括

source: Generates files that are used by Eclipse IDE, thus making it possible to import the project into Eclipse.
zh_cn: 生成Eclipse IDE所用到的文件，从而使项目能够导入到 Eclipse。

source: Generates files that are used by Intellij IDEA IDE, thus making it possible to import the project into IDEA.
zh_cn: 生成Intellij IDEA IDE所用到的文件，从而使项目能够导入到 IDEA。

source: Generates general metadata - id, description and version
zh_cn: 生成通用元数据 - id，description 和 version

source: Generates global exclusions from Maven enforcer plugin settings
zh_cn: 从 Maven enforcer 插件设置生成全局的 exclusions

source: Generates minimal .project file.
zh_cn: 生成最小的.project文件。

source: Generates reports containing useful information about your Gradle build.
zh_cn: 生成关于Gradle构建中有用的信息的报告。

source: Generates the .classpath file.
zh_cn: 生成.classpath文件。

source: Generates the .iml file
zh_cn: 生成 .iml 文件

source: Generates the .ipr file.
zh_cn: 生成 .ipr 文件。

source: Generates the .iws file.
zh_cn: 生成 .iws 文件。

source: Generates the .project file.
zh_cn: 生成的.project文件。

source: Generates the .settings/org.eclipse.jdt.core.prefs file.
zh_cn: 生成.settings/org.eclipse.jdt.core.prefs文件。

source: Generates the .settings/org.eclipse.wst.common.component file only if eclipse-wtp plugin was applied.
zh_cn: 只有当eclipse-wtp插件应用的时候，生成 .settings/org.eclipse.wst.common.component 文件。

source: Generates the .settings/org.eclipse.wst.common.project.facet.core.xml file only if eclipse-wtp plugin was applied.
zh_cn: 只有当eclipse-wtp插件应用的时候，生成 .settings/org.eclipse.wst.common.project.facet.core.xml 文件。

source: Generates the project dependency report.
zh_cn: 生成项目依赖项报告。

source: Generates the project property report.
zh_cn: 生成项目属性报告。

source: Generates the project task report.
zh_cn: 生成项目任务报告。

source: Generates the source files for all ANTLR grammars for the given source set.
zh_cn: 为给定的 source set 的所有 ANTLR 语法生成源文件。

source: Generates the source files for all production ANTLR grammars.
zh_cn: 为所有生产 ANTLR 语法生成源文件。

source: Generates the source files for all test ANTLR grammars.
zh_cn: 为所有测试 ANTLR 语法生成源文件。

source: Generating Javadoc for a source set:
zh_cn: 为一个源集生成 Javadoc：

source: Get feedback faster by running quick verification tasks before long verification tasks: eg.
zh_cn: 通过在长久验证前运行快速验证以得到更快的反馈：如，

source: Getting Started
zh_cn: 入门教程

source: Getting help
zh_cn: 获取帮助

source: Getting help writing build scripts
zh_cn: 获取有关编写构建脚本帮助

source: Given a parameterized test method named aParameterizedTestMethod that takes two parameters, it will be reported with the name: aParameterizedTestMethod(toStringValueOfParam1, toStringValueOfParam2).
zh_cn: 给定一个带有两个参数，名为aParameterizedTestMethod参数化测试方法，它将使用名称这个名称进行报告 ：aParameterizedTestMethod(toStringValueOfParam1, toStringValueOfParam2)。

source: Given a required dependency, Gradle first attempts to resolve the module for that dependency.
zh_cn: 给出所需的依赖项，Gradle 首先尝试为该依赖解析模块。

source: Given that the project name is "myproject" and version "1.2", running "gradle customDistZip" will produce a ZIP file named "myproject-custom-1.2.zip".
zh_cn: 给定项目的名称为“myproject”，版本为“1.2”，运行“gradle customDistZip”将会产生一个名字为”myproject-custom-1.2.zip“的 ZIP 文件。

source: Given the personal and private nature of these values, a good practice is to store them in the user gradle.properties file (described in Section 14.2, “Gradle properties and system properties”).
zh_cn: 鉴于这些值的个人和私人性质，一个好的做法是将它们保存在用户的gradle.properties文件（第14.2 节，“Gradle 属性和系统属性”中所述）。

source: Gradle 1.4 introduces an incubating opt-in feature called configuration on demand.
zh_cn: Gradle 1.4 引入了一个孵化中的选择性加入的功能，叫configuration on demand。

source: Gradle always evaluates every project of the multi-project build and creates all existing task objects.
zh_cn: Gradle总是评估多项目构建的每一个项目，以及创建所有存在的任务对象。

source: Gradle API dependency
zh_cn: Gradle API 依赖

source: Gradle Plugins
zh_cn: Gradle 插件

source: Gradle User Guide
zh_cn: Gradle 用户指南

source: Gradle adds some concepts and APIs to help you achieve this.
zh_cn: Gradle 添加了一些概念和 API 来帮助您实现这一目标。

source: Gradle allows any project to access any other project during both the configuration and execution phases.
zh_cn: Gradle 允许任何项目在配置和执行阶段访问其他项目。

source: Gradle allows you to access any project of the multi-project build from any build script.
zh_cn: Gradle 允许你从任何构建脚本访问多项目构建的任意一个project。

source: Gradle already has much of the information needed for Sonar Runner to successfully analyze a project.
zh_cn: Gradle 已经有很多 Sonar Runner 成功分析一个项目所需的信息。

source: Gradle also provides a logger property to a build script, which is an instance of Logger.
zh_cn: Gradle 还提供了一个 logger属性给构建脚本，它是一个 Logger 实例。

source: Gradle also provides integration with the Java Util Logging, Jakarta Commons Logging and Log4j logging toolkits.
zh_cn: Gradle 还提供了对 Java Util Logging，Jakarta Commons Logging 和 Log4j 的日志工具的集成。

source: Gradle also scan up the inheritance tree into jar files on the test classpath.
zh_cn: Gradle 还将扫描测试类路径中的 jar 文件里的继承树。

source: Gradle and other build tools all have the ability to solve this dependency tree and resolve conflicts, but what differentiates Gradle is the control it gives you over transitive dependencies and conflict resolution.
zh_cn: Gradle 和其他的构建工具都能够处理这种关系树和解决冲突问题，但不同的是，Gradle 让你可以控制传递依赖和冲突的解决。

source: Gradle at its core intentionally provides little useful functionality for real world automation.
zh_cn: Gradle 在它的核心中有意地提供了一些小但有用的功能，用于在真实世界中的自动化。

source: Gradle builds the complete dependency graph before any task is executed.
zh_cn: Gradle 则在所有任务执行之前生成这这个完整的依赖关系图。

source: Gradle contains a highly sophisticated dependency caching mechanism, which seeks to minimise the number of remote requests made in dependency resolution, while striving to guarantee that the results of dependency resolution are correct and reproducible.
zh_cn: Gradle 包含了一个高度复杂的依赖缓存机制，该机制力求减少依赖解析中的远程请求，同时努力保证依赖解析结果的正确及可再生性。

source: Gradle creates Project objects for every project taking part in the build.
zh_cn: 在构建中，Gradle 为每个参加构建的项目创建 Project 对象。

source: Gradle default
zh_cn: Gradle 默认值

source: Gradle defines 6 log levels, as shown in Table 18.1, “Log levels”.
zh_cn: Gradle 定义了6个日志级别，如表 18.1，“日志级别”所示。

source: Gradle defines each OS/architecture combination as a Platform, and a project may define any number of platforms.
zh_cn: Gradle 把每一个系统架构组合定义为一个 Platform，一个project可以定义多个platforms。

source: Gradle determines the subset of the tasks, created and configured during the configuration phase, to be executed.
zh_cn: Gradle 确定在配置阶段中，创建和配置的要被执行的任务的子集。

source: Gradle distinguishes between external dependencies and dependencies on projects which are part of the same multi-project build.
zh_cn: 对于多项目构建，Gradle 能区分外部依赖与作为多项目构建的一部分的某个项目上的依赖。

source: Gradle does not care.
zh_cn: Gradle 不关心这个问题。

source: Gradle exclude rules are converted to Maven excludes if possible.
zh_cn: 如果有可能，Gradle排除的规则会被转换为Maven excludes。

source: Gradle guarantees that these tasks are executed in the order of their dependencies, and that each task is executed only once.
zh_cn: Gradle 保证这些任务按照它们的依赖关系的顺序进行执行，并且每个任务都只执行一次。

source: Gradle has no idea what the closure does and cannot automatically figure out whether the task is up-to-date or not.
zh_cn: Gradle 不知道这个闭包做了什么，也无法自动判断这个任务是否为最新状态。

source: Gradle has replaced this direct dependency on Ivy with a native Gradle dependency resolution engine which supports a range of approaches to dependency resolution including both POM and Ivy descriptor files.
zh_cn: Gradle 已经取代了 Ivy 上的直接依赖，而采用了原生的 Gradle 依赖解决引擎，它支持许多的依赖解决方案的方法，包括 POM 文件和 Ivy 描述文件。

source: Gradle has the ability to generate Visual Studio project and solution files for the native components defined in your build.
zh_cn: Gradle 可以为在你的构建中定义的本地组件生成生成 Visual Studio 项目及解决方案文件。

source: Gradle implements this via configuration injection.
zh_cn: Gradle 通过configuration injection来实现它。

source: Gradle includes the parameter values in its reporting of the test method execution.
zh_cn: Gradle 会在这个方法的执行报告中包含进它的参数值。

source: Gradle keeps a record of various aspects of dependency resolution in binary format in the metadata cache.
zh_cn: Gradle 以二进制格式在元数据缓存中保留了依赖解析的各方面的记录。

source: Gradle looks down the hierarchy, starting with the current dir, for tasks with the name hello an executes them.
zh_cn: Gradle 从当前目录开始，按层次结构往下查找名称为hello任务，开始执行它们。

source: Gradle offers a solution for this.
zh_cn: Gradle 为此提供了一个解决方案。

source: Gradle offers a variety of ways to add properties to your build.
zh_cn: Gradle 提供了许多方式将属性添加到您的构建中。

source: Gradle offers multiple ways to skip the execution of a task.
zh_cn: Gradle 提供多种方式来跳过任务的执行。

source: Gradle offers the ability to execute the same build using different tool chains.
zh_cn: Gradle 提供了使用不同的工具链执行相同的构建的能力。

source: Gradle offers the following conflict resolution strategies:
zh_cn: Gradle 提供了以下的冲突解决策略：

source: Gradle offers this to you:
zh_cn: Gradle 也向你提供了这种更细粒度的控制：

source: Gradle offers you different ways to express first-level and transitive dependencies.
zh_cn: Gradle 向你提供了不同的方式来表达第一级的和传递的依赖。

source: Gradle persists both snapshots for next time the task is executed.
zh_cn: Gradle 会保存这两个快照，直到任务的下一次执行。

source: Gradle plugins typically need to be applied to a project before they can be used (see Section 21.1, “Applying plugins”).
zh_cn: Gradle 插件通常需要被应用于 project 中才可以使用（见第 21.1节，"应用插件"）。

source: Gradle properties and system properties
zh_cn: Gradle 属性和系统属性

source: Gradle provides a domain specific language, or DSL, for describing builds.
zh_cn: Gradle 提供一种领域特定语言或者说是 DSL，来描述构建。

source: Gradle provides an artifact only notation for those use cases - simply prefix the extension that you want to be downloaded with '@' sign:
zh_cn: Gradle 提供了一个 artifact only notation 用于这些案例情况——只是对你想要下载的扩展前加个 '@' 标志：

source: Gradle provides different notations for module dependencies.
zh_cn: Gradle 为模块依赖提供了不同的标记法。

source: Gradle provides excellent integration with Ant.
zh_cn: Gradle 提供了对 Ant 的优秀集成

source: Gradle provides mechanisms and sophisticated support and it's a key ingredient in powerful-yet-concise build scripts.
zh_cn: Gradle 对此提供了机制和完善的支持，而它是强大-然而-简洁的构建脚本中的一个关键因素。

source: Gradle provides parallel test execution by running multiple test processes concurrently.
zh_cn: Gradle 通过同时运行多个测试进程来提供并行测试的执行。

source: Gradle provides several options that make it easy to configure the Java process that will be used to execute your build.
zh_cn: Gradle 提供了几个选项，可以很容易地配置将用于执行您的构建的 Java 进程。

source: Gradle provides the core plugins as part of its distribution so simply applying the plugin as above is all you need to do.
zh_cn: Gradle 提供了核心插件作为其发行包的一部分，所以简单地应用如上插件是你所需要做的。

source: Gradle provides two plugins for web application development: the War plugin and the Jetty plugin.
zh_cn: Gradle 为web应用程序开发提供了两个插件：War插件和Jetty插件。

source: Gradle pushes declarative builds to the next level by providing declarative language elements that you can assemble as you like.
zh_cn: Gradle 通过提供可以如你所愿去组合的声明性的语言元素，将声明性构建推向下级。

source: Gradle redirects anything written to standard output to it's logging system at the QUIET log level.
zh_cn: Gradle 会把写到标准输出的所有内容重定向到它的日志系统的 QUIET 级别中。

source: Gradle redirects their logging output into the Gradle logging system.
zh_cn: Gradle 将其日志输出重定向到 Gradle 的日志系统。

source: Gradle repository management, based on Apache Ivy, gives you a lot of freedom regarding repository layout and retrieval policies.
zh_cn: Gradle 仓库管理，基于 Apache Ivy，为你提供了有关仓库布局和获取策略的许多自由。

source: Gradle supports enhanced tasks, that is, tasks which have their own properties and methods.
zh_cn: Gradle 支持增强的任务，也就是，有自己的属性和方法的任务。

source: Gradle supports arbitrary physical layouts for a multiproject build.
zh_cn: Gradle 支持任意的物理布局的多项目构建。

source: Gradle supports single and multi-project builds.
zh_cn: Gradle 支持单项目及多项目的构建。

source: Gradle supports two types of task.
zh_cn: Gradle 支持两种类型的任务。

source: Gradle takes your dependency declarations and repository definitions and attempts to download all of your dependencies by a process called dependency resolution.
zh_cn: Gradle 将获取你的依赖声明和仓库定义，并通过一个称为依赖项解析的过程尝试下载所有依赖项。

source: Gradle then executes each of the selected tasks.
zh_cn: 然后 Gradle 执行每个选定的任务。

source: Gradle then executes the task.
zh_cn: 然后 Gradle 执行该任务。

source: Gradle tries best to filter the tests given limitations of particular test framework API.
zh_cn: Gradle 尽最大努力对有着特定的测试框架 API 的局限的测试进行过滤。

source: Gradle understands this language, and allows you to import your Ant build.xml directly into a Gradle project.
zh_cn: Gradle 理解这种语言，并允许您直接导入你的Ant build.xml 到 Gradle 项目中。

source: Gradle uploads the jars of your project to the company repository together with the XML descriptor file of the dependencies.
zh_cn: Gradle 会将你的项目的 jar 包以及这仆依赖的 XML 描述文件上传到公司仓库。

source: Gradle uses the same logic as Maven to identify the location of your local Maven cache.
zh_cn: Gradle 使用与 Maven 相同的逻辑来标识你本地的 Maven 缓存的位置。

source: Gradle uses this for configuration closures, where the delegate object is set to the object to be configured.
zh_cn: Gradle 在配置闭包中使用到它，把委托对象设置为被配置的对象。

source: Gradle will call the method when the task executes.
zh_cn: 当任务执行的时候，Gradle 就会调用这个方法。

source: Gradle will create a CSourceSet named 'cunit' for each CUnitTestSuite component in the project.
zh_cn: Gradle将为项目中的每一个 CUnitTestSuite 组件创建一个名字为“cunit”的CSourceSet。
